const rules = {
  // 6位数字验证码
  numberCode6: {
    regex: /^\d{6,6}$/,
    errorMsg: '请输入6位数字验证码',
  },

  // 8位数字验证码
  numberCode8: {
    regex: /^\d{8,8}$/,
    errorMsg: '请输入8位数字验证码',
  },

  //	手机号码校验
  phone: {
    regex: /(^1[3456789]\d{9}$)|^$/,
    errorMsg: '请输入正确的手机号码',
  },

  //	电子邮箱校验
  email: {
    regex:
      /^((([a-z]|\d|[!#\$%&'\*\+\-\/=\?\^_`{\|}~]|[\u00A0-\uD7FF\uF900-\uFDCF\uFDF0-\uFFEF])+(\.([a-z]|\d|[!#\$%&'\*\+\-\/=\?\^_`{\|}~]|[\u00A0-\uD7FF\uF900-\uFDCF\uFDF0-\uFFEF])+)*)|((\x22)((((\x20|\x09)*(\x0d\x0a))?(\x20|\x09)+)?(([\x01-\x08\x0b\x0c\x0e-\x1f\x7f]|\x21|[\x23-\x5b]|[\x5d-\x7e]|[\u00A0-\uD7FF\uF900-\uFDCF\uFDF0-\uFFEF])|(\\([\x01-\x09\x0b\x0c\x0d-\x7f]|[\u00A0-\uD7FF\uF900-\uFDCF\uFDF0-\uFFEF]))))*(((\x20|\x09)*(\x0d\x0a))?(\x20|\x09)+)?(\x22)))@((([a-z]|\d|[\u00A0-\uD7FF\uF900-\uFDCF\uFDF0-\uFFEF])|(([a-z]|\d|[\u00A0-\uD7FF\uF900-\uFDCF\uFDF0-\uFFEF])([a-z]|\d|-|\.|_|~|[\u00A0-\uD7FF\uF900-\uFDCF\uFDF0-\uFFEF])*([a-z]|\d|[\u00A0-\uD7FF\uF900-\uFDCF\uFDF0-\uFFEF])))\.)+(([a-z]|[\u00A0-\uD7FF\uF900-\uFDCF\uFDF0-\uFFEF])|(([a-z]|[\u00A0-\uD7FF\uF900-\uFDCF\uFDF0-\uFFEF])([a-z]|\d|-|\.|_|~|[\u00A0-\uD7FF\uF900-\uFDCF\uFDF0-\uFFEF])*([a-z]|[\u00A0-\uD7FF\uF900-\uFDCF\uFDF0-\uFFEF])))\.?$/i,
    errorMsg: ' 无效的邮件地址',
  },

  //	电子邮箱和手机号码校验
  emailOrPhone: {
    regex: /(^1[34578]\d{9}$)|(^[0-9a-z_][_.0-9a-z-]{0,31}@([0-9a-z][0-9a-z-]{0,30}\.){1,4}[a-z]{2,4}$)/,
    errorMsg: ' 无效的手机号/邮箱',
  },

  //	最多输入两位小数
  validateTwoDecimal: {
    regex: /^(\d+)(\.\d+)?$/,
    errorMsg: '最多输入两位小数',
  },

  //	正整数类型
  checkUnsignInt: {
    regex: /^[1-9]{1}\d*$/,
    errorMsg: '请输入正整数',
  },

  //	整数类型
  integer: {
    regex: /^[\-\+]?\d+$/,
    errorMsg: ' 无效的整数',
  },

  //	数字类型
  number: {
    regex: /^[\-\+]?((([0-9]{1,3})([,][0-9]{3})*)|([0-9]+))?([\.]([0-9]+))?$/,
    errorMsg: ' 无效的数值',
  },

  //	浮点数类型
  float: {
    regex: /^(-?\d+)(\.\d+)?$/,
    errorMsg: '请输入正确的浮点数',
  },

  //	日期YYYY-MM-DD
  date: {
    regex: /^\d{4}[\/\-](0?[1-9]|1[012])[\/\-](0?[1-9]|[12][0-9]|3[01])$/,
    errorMsg: ' 无效的日期，格式必需为 YYYY-MM-DD',
  },

  //	校验日期格式
  dateFormat: {
    regex:
      /^\d{4}[\/\-](0?[1-9]|1[012])[\/\-](0?[1-9]|[12][0-9]|3[01])$|^(?:(?:(?:0?[13578]|1[02])(\/|-)31)|(?:(?:0?[1,3-9]|1[0-2])(\/|-)(?:29|30)))(\/|-)(?:[1-9]\d\d\d|\d[1-9]\d\d|\d\d[1-9]\d|\d\d\d[1-9])$|^(?:(?:0?[1-9]|1[0-2])(\/|-)(?:0?[1-9]|1\d|2[0-8]))(\/|-)(?:[1-9]\d\d\d|\d[1-9]\d\d|\d\d[1-9]\d|\d\d\d[1-9])$|^(0?2(\/|-)29)(\/|-)(?:(?:0[48]00|[13579][26]00|[2468][048]00)|(?:\d\d)?(?:0[48]|[2468][048]|[13579][26]))$/,
    errorMsg: ' 无效的日期格式',
  },

  //	日期时间校验
  dateTimeFormat: {
    regex:
      /^\d{4}[\/\-](0?[1-9]|1[012])[\/\-](0?[1-9]|[12][0-9]|3[01])\s+(1[012]|0?[1-9]){1}:(0?[1-5]|[0-6][0-9]){1}:(0?[0-6]|[0-6][0-9]){1}\s+(am|pm|AM|PM){1}$|^(?:(?:(?:0?[13578]|1[02])(\/|-)31)|(?:(?:0?[1,3-9]|1[0-2])(\/|-)(?:29|30)))(\/|-)(?:[1-9]\d\d\d|\d[1-9]\d\d|\d\d[1-9]\d|\d\d\d[1-9])$|^((1[012]|0?[1-9]){1}\/(0?[1-9]|[12][0-9]|3[01]){1}\/\d{2,4}\s+(1[012]|0?[1-9]){1}:(0?[1-5]|[0-6][0-9]){1}:(0?[0-6]|[0-6][0-9]){1}\s+(am|pm|AM|PM){1})$/,
    errorMsg: ' 无效的日期或时间格式',
  },


  //	网址校验
  url: {
    regex:
      /^(https?|ftp):\/\/(((([a-z]|\d|-|\.|_|~|[\u00A0-\uD7FF\uF900-\uFDCF\uFDF0-\uFFEF])|(%[\da-f]{2})|[!\$&'\(\)\*\+,;=]|:)*@)?(((\d|[1-9]\d|1\d\d|2[0-4]\d|25[0-5])\.(\d|[1-9]\d|1\d\d|2[0-4]\d|25[0-5])\.(\d|[1-9]\d|1\d\d|2[0-4]\d|25[0-5])\.(\d|[1-9]\d|1\d\d|2[0-4]\d|25[0-5]))|((([a-z]|\d|[\u00A0-\uD7FF\uF900-\uFDCF\uFDF0-\uFFEF])|(([a-z]|\d|[\u00A0-\uD7FF\uF900-\uFDCF\uFDF0-\uFFEF])([a-z]|\d|-|\.|_|~|[\u00A0-\uD7FF\uF900-\uFDCF\uFDF0-\uFFEF])*([a-z]|\d|[\u00A0-\uD7FF\uF900-\uFDCF\uFDF0-\uFFEF])))\.)+(([a-z]|[\u00A0-\uD7FF\uF900-\uFDCF\uFDF0-\uFFEF])|(([a-z]|[\u00A0-\uD7FF\uF900-\uFDCF\uFDF0-\uFFEF])([a-z]|\d|-|\.|_|~|[\u00A0-\uD7FF\uF900-\uFDCF\uFDF0-\uFFEF])*([a-z]|[\u00A0-\uD7FF\uF900-\uFDCF\uFDF0-\uFFEF])))\.?)(:\d*)?)(\/((([a-z]|\d|-|\.|_|~|[\u00A0-\uD7FF\uF900-\uFDCF\uFDF0-\uFFEF])|(%[\da-f]{2})|[!\$&'\(\)\*\+,;=]|:|@)+(\/(([a-z]|\d|-|\.|_|~|[\u00A0-\uD7FF\uF900-\uFDCF\uFDF0-\uFFEF])|(%[\da-f]{2})|[!\$&'\(\)\*\+,;=]|:|@)*)*)?)?(\?((([a-z]|\d|-|\.|_|~|[\u00A0-\uD7FF\uF900-\uFDCF\uFDF0-\uFFEF])|(%[\da-f]{2})|[!\$&'\(\)\*\+,;=]|:|@)|[\uE000-\uF8FF]|\/|\?)*)?(\#((([a-z]|\d|-|\.|_|~|[\u00A0-\uD7FF\uF900-\uFDCF\uFDF0-\uFFEF])|(%[\da-f]{2})|[!\$&'\(\)\*\+,;=]|:|@)|\/|\?)*)?$/i,
    errorMsg: ' 无效的网址',
  },

  //	校验英文字母
  onlyLetter: {
    regex: /^[a-zA-Z\ \']+$/,
    errorMsg: ' 只能填写英文字母',
  },

  //	英文和数字校验
  onlyLetterNumber: {
    regex: /^[0-9a-zA-Z]+$/,
    errorMsg: ' 只能填写数字与英文字母',
  },

  //	汉字校验
  chinese: {
    regex: /^[\u4E00-\u9FA5]+$/,
    errorMsg: ' 只能填写中文汉字',
  },

  //	邮政编码校验
  chinaZip: {
    regex: /^\d{6}$/,
    errorMsg: ' 无效的邮政编码',
  },

  // 密码验证
  checkPassword618: {
    regex:
      /^([\w~`!@#$%^&*()_+-=\[\]\{\}\|\\:;'"<>,\.\?\/]{6,18}|[\w~`!@#$%^&*()_+-=\[\]\{\}\|\\:;'"<>,\.\?\/]{32}|^)$/,
    errorMsg: ' 请输入6-18位密码',
  },

  // 密码验证-字母和数字组合
  checkPasswordLetterNumber: {
    regex: /^(?![0-9]+$)(?![a-zA-Z]+$)[0-9A-Za-z]{6,18}$/,
    errorMsg: '密码应为6-18位字母和数字组合',
  },

  // 姓名格式验证
  checkRealName: {
    regex: /^[A-Za-z\u4e00-\u9fa5]{0,15}$/,
    errorMsg: '最多可输入15字，包含中文、字母',
  },

  // 验证昵称
  checkName: {
    regex: /^[0-9A-Za-z\u4e00-\u9fa5]{0,15}$/,
    errorMsg: ' 最多可输入15字，包含中文，字母，数字',
  },
  // 验证邮编
  checkCode: {
    regex: /^[0-9]{6}$/,
    errorMsg: ' 请输入合法的邮政编码',
  },

  //	用户输入内容
  checkIntro: {
    regex: /^[0-9A-Za-z\u4e00-\u9fa5]{0,500}$/,
    errorMsg: '只能包含汉字、字母、数字，且最多为500字',
  },

  //	校验手机号码
  phonenumber: {
    regex: /^[\-\+]?((([0-9]{1,3})([,][0-9]{3})*)|([0-9]+))?([\.]([0-9]+))?$/,
    errorMsg: ' 无效的电话号码',
  },


  // 关键词校验
  keywordcheck: {
    regex: /^[A-Za-z0-9\u4e00-\u9fa5]+(,[A-Za-z0-9\u4e00-\u9fa5]{1,15})*$/,
    errorMsg: '必须以","(英文逗号)分隔符,最后一个关键词不需要逗号',
  },

  //	关键词最多输入10个
  validateKeywordMax10: {
    regex: /^([A-Za-z0-9\u4e00-\u9fa5]+(\；|\;){0,1}){1,10}$/,
    errorMsg: '请输入正确的关键词格式：最多可输入10个，以；隔开',
  },

  // 敏感词最多输入十个
  sensitiveWordsMax10: {
    regex: /^[A-Za-z0-9\u4e00-\u9fa5]{1,10}$/,
    errorMsg: '请输入需要新增的敏感词',
  },
};

module.exports = rules;
